**Vedant Modak**
  | BE(IT) undergrad @ PES Modern College of Engineering,Pune.

**Capital Asset Pricing Model**

**Calculating Beta of a  Stock**

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [11]:
df1=pd.read_csv(r'F:\Data Analytics\Portfolio\Projects\Project - 6 (Stock Market Analysis)\NIFTY50_all.csv')

In [9]:
df2=pd.read_csv('F:\Data Analytics\Portfolio\Projects\Project - 6 (Stock Market Analysis)\ITC.csv')

In [12]:
df1.head()

,Date,Symbol,Series,Prev Close,Open,High,Low,Last,Close,VWAP,Volume,Turnover,Trades,Deliverable Volume,%Deliverble
0,2007-11-27,MUNDRAPORT,EQ,440.00,770.00,1050.00,770.0,959.0,962.90,984.72,27294366,2.687719e+15,NaN,9859619.0,0.3612
1,2007-11-28,MUNDRAPORT,EQ,962.90,984.00,990.00,874.0,885.0,893.90,941.38,4581338,4.312765e+14,NaN,1453278.0,0.3172
2,2007-11-29,MUNDRAPORT,EQ,893.90,909.00,914.75,841.0,887.0,884.20,888.09,5124121,4.550658e+14,NaN,1069678.0,0.2088
3,2007-11-30,MUNDRAPORT,EQ,884.20,890.00,958.00,890.0,929.0,921.55,929.17,4609762,4.283257e+14,NaN,1260913.0,0.2735
4,2007-12-03,MUNDRAPORT,EQ,921.55,939.75,995.00,922.0,980.0,969.30,965.65,2977470,2.875200e+14,NaN,816123.0,0.2741

In [13]:
df2.head()

,Date,Symbol,Series,Prev Close,Open,High,Low,Last,Close,VWAP,Volume,Turnover,Trades,Deliverable Volume,%Deliverble
0,2000-01-03,ITC,EQ,656.00,694.00,708.50,675.0,708.50,708.50,701.81,562715,3.949174e+13,NaN,NaN,NaN
1,2000-01-04,ITC,EQ,708.50,714.00,729.00,694.3,710.65,712.35,714.16,712637,5.089379e+13,NaN,NaN,NaN
2,2000-01-05,ITC,EQ,712.35,716.25,758.90,660.0,731.00,726.20,732.43,1382149,1.012325e+14,NaN,NaN,NaN
3,2000-01-06,ITC,EQ,726.20,741.00,784.30,741.0,784.30,784.30,776.63,721618,5.604266e+13,NaN,NaN,NaN
4,2000-01-07,ITC,EQ,784.30,832.40,847.05,824.0,847.05,847.05,841.25,231209,1.945046e+13,NaN,NaN,NaN

In [14]:
df1.rename(columns={"VWAP": "NiftyVWAP"}, inplace=True)

In [15]:
df2.rename(columns={"VWAP": "ITCVWAP"}, inplace=True)

In [17]:
df3=pd.concat([df1['NiftyVWAP'], df2['ITCVWAP']], axis=1, keys=['Nifty', 'ITC'])
df3.head()

    Nifty     ITC
0  984.72  701.81
1  941.38  714.16
2  888.09  732.43
3  929.17  776.63
4  965.65  841.25

In [19]:
sec_returns=np.log(df3/df3.shift(1))
sec_returns

           Nifty       ITC
0            NaN       NaN
1      -0.045010  0.017444
2      -0.058274  0.025261
3       0.045219  0.058596
4       0.038510  0.079925
...          ...       ...
235187 -0.014256       NaN
235188  0.010935       NaN
235189 -0.002961       NaN
235190 -0.007494       NaN
235191  0.000480       NaN

[235192 rows x 2 columns]

In [20]:
cov=sec_returns.cov()*250
cov

          Nifty       ITC
Nifty  0.521813 -0.002696
ITC   -0.002696  0.435092

In [21]:
cov_with_market=cov.iloc[0,1]
cov_with_market

-0.002695581724583941

In [22]:
market_var=sec_returns['Nifty'].var()*250
market_var

0.52181306434763

**Beta**

In [23]:
ITC_Beta=cov_with_market/market_var
ITC_Beta

-0.00516579961054435

**Predicting Returns**

In [29]:
ITC_er= 0.025+ITC_Beta*0.05    
#CAPM ri=rf+Beta(stock)(rm-rf)
# ri= expected returns, rf=risk free , rm=market returns, 
print('Expected returns of ITC:', ITC_er*100)

Expected returns of ITC: 2.4741710019472785

**Sharpe Ratio**

In [30]:
ITC_Sharpe=(ITC_er-0.025)/ (sec_returns['ITC'].std()*250**0.5)
ITC_Sharpe

-0.00039157666028746097